---
type: AXMImportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# AXMImportOptions

`Autodesk.Revit.DB.AXMImportOptions` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AXMImportOptions | — | `` |
| Constructor | AXMImportOptions | 2022.1 | `public AXMImportOptions ()` |
| Property | ImportLevels | 2022.1 | `public bool ImportLevels { get ; set ; }` |